#### Exercícios de fixação

1.	Crie uma lista com o quadrado dos números inteiros de 0 a 10. A lista deve ter este resultado: [0, 1, 4, 9, ..., 100]

In [1]:
lista_quadrado = [i**2 for i in range(11)]
print(lista_quadrado)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

2.	Retorne uma lista positiva (só com elementos positivos) da seguinte lista: [-3, 4, 8, -99, 0, -6]

In [7]:
lista_positiva = [abs(i) for i in [-3,4,8,-99,0,-6]]
lista_positiva

[3, 4, 8, 99, 0, 6]

3.	Crie um dataframe com duas colunas: “nome” e “idade”. Onde os nomes são os integrantes da sua família e idade também.

In [8]:
import pandas as pd

In [9]:
df_dados = pd.DataFrame({'nome':['Gustavo Amorim', 'Nicolle Amorim', 'Edivaldo Amorim', 'Adenilze Santos'],
                        'idade':[33, 29, 68, 61]})

df_dados

              nome  idade
0   Gustavo Amorim     33
1   Nicolle Amorim     29
2  Edivaldo Amorim     68
3  Adenilze Santos     61

4.	Agora transforme a coluna ”nome” do dataframe anterior pegando somente o primeiro nome e adicione à uma coluna nova.

In [10]:
# o método split() irá dividir a string e o método get() irá pegar a primeira posição com o 0
df_dados['primeiro_nome'] = df_dados.nome.str.split().str.get(0)

In [11]:
df_dados

              nome  idade primeiro_nome
0   Gustavo Amorim     33       Gustavo
1   Nicolle Amorim     29       Nicolle
2  Edivaldo Amorim     68      Edivaldo
3  Adenilze Santos     61      Adenilze

5.	Transforme a coluna “idade” de inteiro para float.

In [12]:
df_dados.idade = df_dados.idade.astype(float)
df_dados

              nome  idade primeiro_nome
0   Gustavo Amorim   33.0       Gustavo
1   Nicolle Amorim   29.0       Nicolle
2  Edivaldo Amorim   68.0      Edivaldo
3  Adenilze Santos   61.0      Adenilze

6.	Crie mais um dataframe também com os nomes e idades de seus 3 melhores amigos. Concatene este dataframe com o anterior (excluindo a coluna de primeiro nome).

In [13]:
df_amigos = pd.DataFrame({'nome':['Dani','Barbara','Gabriel'],
                            'idade':[30,30,29]})

In [14]:
df_amigos

      nome  idade
0     Dani     30
1  Barbara     30
2  Gabriel     29

In [17]:
# usando o método concat para juntar os dois dataframes. É necessário informar os dataframes dentro de uma lista para correto funcionamento.

df_novo = pd.concat([df_dados, df_amigos])
df_novo

              nome  idade primeiro_nome
0   Gustavo Amorim   33.0       Gustavo
1   Nicolle Amorim   29.0       Nicolle
2  Edivaldo Amorim   68.0      Edivaldo
3  Adenilze Santos   61.0      Adenilze
0             Dani   30.0           NaN
1          Barbara   30.0           NaN
2          Gabriel   29.0           NaN

In [18]:
# realizando o reset do índice usando o método reset_index
df_novo.reset_index(drop=True, inplace=True)
df_novo

              nome  idade primeiro_nome
0   Gustavo Amorim   33.0       Gustavo
1   Nicolle Amorim   29.0       Nicolle
2  Edivaldo Amorim   68.0      Edivaldo
3  Adenilze Santos   61.0      Adenilze
4             Dani   30.0           NaN
5          Barbara   30.0           NaN
6          Gabriel   29.0           NaN

In [19]:
# eliminando a coluna primeiro_nome usando o método drop
df_novo.drop(columns='primeiro_nome', inplace=True)
df_novo

              nome  idade
0   Gustavo Amorim   33.0
1   Nicolle Amorim   29.0
2  Edivaldo Amorim   68.0
3  Adenilze Santos   61.0
4             Dani   30.0
5          Barbara   30.0
6          Gabriel   29.0